Ran Plan for dir: `infra/gcp/terraform/k8s-infra-prow-build` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place
- destroy
+/- create replacement and then destroy

Terraform will perform the following actions:

  # google_vmwareengine_network_peering.gvce_peering will be updated in-place
~ resource "google_vmwareengine_network_peering" "gvce_peering" {
      ~ export_custom_routes_with_public_ip = false -> true
        id                                  = "projects/k8s-infra-prow-build/locations/global/networkPeerings/peer-with-gcve-project"
      ~ import_custom_routes_with_public_ip = false -> true
        name                                = "peer-with-gcve-project"
        # (13 unchanged attributes hidden)
    }

  # module.prow_build_nodepool_c4a_highmem_8_localssd.google_container_node_pool.node_pool will be created
+ resource "google_container_node_pool" "node_pool" {
      + cluster                     = (sensitive value)
      + id                          = (known after apply)
      + initial_node_count          = 1
      + instance_group_urls         = (known after apply)
      + location                    = (sensitive value)
      + managed_instance_group_urls = (known after apply)
      + max_pods_per_node           = (known after apply)
      + name                        = (known after apply)
      + name_prefix                 = "pool7-arm64-"
      + node_count                  = (known after apply)
      + node_locations              = [
          + "us-central1-a",
          + "us-central1-b",
          + "us-central1-c",
        ]
      + operation                   = (known after apply)
      + project                     = "k8s-infra-prow-build"
      + version                     = (known after apply)

      + autoscaling {
          + location_policy = (known after apply)
          + max_node_count  = 10
          + min_node_count  = 1
        }

      + management {
          + auto_repair  = true
          + auto_upgrade = true
        }

      + network_config (known after apply)

      + node_config {
          + disk_size_gb     = 100
          + disk_type        = "hyperdisk-balanced"
          + effective_taints = (known after apply)
          + image_type       = "UBUNTU_CONTAINERD"
          + labels           = (known after apply)
          + local_ssd_count  = (known after apply)
          + logging_variant  = (known after apply)
          + machine_type     = "c4a-highmem-8-lssd"
          + metadata         = {
              + "disable-legacy-endpoints" = "true"
            }
          + min_cpu_platform = (known after apply)
          + oauth_scopes     = [
              + "https://www.googleapis.com/auth/cloud-platform",
            ]
          + preemptible      = false
          + service_account  = "gke-nodes-prow-build@k8s-infra-prow-build.iam.gserviceaccount.com"
          + spot             = false

          + confidential_nodes (known after apply)

          + gcfs_config (known after apply)

          + guest_accelerator (known after apply)

          + kubelet_config (known after apply)

          + shielded_instance_config (known after apply)

          + windows_node_config (known after apply)

          + workload_metadata_config {
              + mode = "GKE_METADATA"
            }
        }

      + upgrade_settings (known after apply)
    }

  # module.prow_build_nodepool_c4d_highmem_8_localssd.google_container_node_pool.node_pool will be created
+ resource "google_container_node_pool" "node_pool" {
      + cluster                     = (sensitive value)
      + id                          = (known after apply)
      + initial_node_count          = 1
      + instance_group_urls         = (known after apply)
      + location                    = (sensitive value)
      + managed_instance_group_urls = (known after apply)
      + max_pods_per_node           = (known after apply)
      + name                        = (known after apply)
      + name_prefix                 = "pool7-"
      + node_count                  = (known after apply)
      + node_locations              = [
          + "us-central1-a",
          + "us-central1-b",
          + "us-central1-c",
        ]
      + operation                   = (known after apply)
      + project                     = "k8s-infra-prow-build"
      + version                     = (known after apply)

      + autoscaling {
          + location_policy = (known after apply)
          + max_node_count  = 80
          + min_node_count  = 1
        }

      + management {
          + auto_repair  = true
          + auto_upgrade = true
        }

      + network_config (known after apply)

      + node_config {
          + disk_size_gb     = 100
          + disk_type        = "hyperdisk-balanced"
          + effective_taints = (known after apply)
          + image_type       = "COS_CONTAINERD"
          + labels           = (known after apply)
          + local_ssd_count  = (known after apply)
          + logging_variant  = (known after apply)
          + machine_type     = "c4d-highmem-8-lssd"
          + metadata         = {
              + "disable-legacy-endpoints" = "true"
            }
          + min_cpu_platform = (known after apply)
          + oauth_scopes     = [
              + "https://www.googleapis.com/auth/cloud-platform",
            ]
          + preemptible      = false
          + service_account  = "gke-nodes-prow-build@k8s-infra-prow-build.iam.gserviceaccount.com"
          + spot             = false

          + confidential_nodes (known after apply)

          + gcfs_config (known after apply)

          + guest_accelerator (known after apply)

          + kubelet_config (known after apply)

          + shielded_instance_config (known after apply)

          + windows_node_config (known after apply)

          + workload_metadata_config {
              + mode = "GKE_METADATA"
            }
        }

      + upgrade_settings (known after apply)
    }

  # module.prow_build_nodepool_n1_highmem_8_localssd.google_container_node_pool.node_pool must be replaced
+/- resource "google_container_node_pool" "node_pool" {
      ~ id                          = "projects/k8s-infra-prow-build/locations/us-central1/clusters/prow-build/nodePools/pool5-20210928124956061000000001" -> (known after apply)
      ~ initial_node_count          = 0 -> 1 # forces replacement
      ~ instance_group_urls         = [
          - "https://www.googleapis.com/compute/v1/projects/k8s-infra-prow-build/zones/us-central1-c/instanceGroupManagers/gke-prow-build-pool5-2021092812495606-e8f905a4-grp",
          - "https://www.googleapis.com/compute/v1/projects/k8s-infra-prow-build/zones/us-central1-f/instanceGroupManagers/gke-prow-build-pool5-2021092812495606-72cb7850-grp",
          - "https://www.googleapis.com/compute/v1/projects/k8s-infra-prow-build/zones/us-central1-b/instanceGroupManagers/gke-prow-build-pool5-2021092812495606-3a8095df-grp",
        ] -> (known after apply)
      ~ managed_instance_group_urls = [
          - "https://www.googleapis.com/compute/beta/projects/k8s-infra-prow-build/zones/us-central1-c/instanceGroups/gke-prow-build-pool5-2021092812495606-e8f905a4-grp",
          - "https://www.googleapis.com/compute/beta/projects/k8s-infra-prow-build/zones/us-central1-f/instanceGroups/gke-prow-build-pool5-2021092812495606-72cb7850-grp",
          - "https://www.googleapis.com/compute/beta/projects/k8s-infra-prow-build/zones/us-central1-b/instanceGroups/gke-prow-build-pool5-2021092812495606-3a8095df-grp",
        ] -> (known after apply)
      + max_pods_per_node           = (known after apply)
      ~ name                        = "pool5-20210928124956061000000001" -> (known after apply)
      ~ node_count                  = 0 -> (known after apply)
      + operation                   = (known after apply)
      ~ version                     = "1.32.3-gke.1927009" -> (known after apply)
        # (5 unchanged attributes hidden)

      ~ autoscaling {
          ~ location_policy      = "BALANCED" -> (known after apply)
          - total_max_node_count = 0 -> null
          - total_min_node_count = 0 -> null
            # (2 unchanged attributes hidden)
        }

      ~ network_config (known after apply)

      ~ node_config {
          ~ effective_taints            = [] -> (known after apply)
          - enable_confidential_storage = false -> null
          ~ labels                      = {} -> (known after apply)
          ~ local_ssd_count             = 0 -> (known after apply)
          ~ logging_variant             = "DEFAULT" -> (known after apply)
          + min_cpu_platform            = (known after apply)
          - resource_labels             = {} -> null
          - resource_manager_tags       = {} -> null
          - storage_pools               = [] -> null
          - tags                        = [] -> null
            # (13 unchanged attributes hidden)

          ~ confidential_nodes (known after apply)

          ~ gcfs_config (known after apply)

          ~ guest_accelerator (known after apply)

          ~ kubelet_config (known after apply)

          ~ shielded_instance_config (known after apply)
          - shielded_instance_config {
              - enable_integrity_monitoring = true -> null
              - enable_secure_boot          = false -> null
            }

          ~ windows_node_config (known after apply)

            # (2 unchanged blocks hidden)
        }

      ~ upgrade_settings (known after apply)
      - upgrade_settings {
          - max_surge       = 1 -> null
          - max_unavailable = 0 -> null
          - strategy        = "SURGE" -> null
        }

        # (1 unchanged block hidden)
    }

  # module.prow_build_nodepool_t2a_standard_8.google_container_node_pool.node_pool will be destroyed
  # (because google_container_node_pool.node_pool is not in configuration)
- resource "google_container_node_pool" "node_pool" {
      - cluster                     = (sensitive value) -> null
      - id                          = "projects/k8s-infra-prow-build/locations/us-central1/clusters/prow-build/nodePools/pool6-arm64-20240830110251604600000001" -> null
      - initial_node_count          = 1 -> null
      - instance_group_urls         = [
          - "https://www.googleapis.com/compute/v1/projects/k8s-infra-prow-build/zones/us-central1-a/instanceGroupManagers/gke-prow-build-pool6-arm64-2024083011-9098ae55-grp",
          - "https://www.googleapis.com/compute/v1/projects/k8s-infra-prow-build/zones/us-central1-b/instanceGroupManagers/gke-prow-build-pool6-arm64-2024083011-af5aa803-grp",
        ] -> null
      - location                    = (sensitive value) -> null
      - managed_instance_group_urls = [
          - "https://www.googleapis.com/compute/beta/projects/k8s-infra-prow-build/zones/us-central1-a/instanceGroups/gke-prow-build-pool6-arm64-2024083011-9098ae55-grp",
          - "https://www.googleapis.com/compute/beta/projects/k8s-infra-prow-build/zones/us-central1-b/instanceGroups/gke-prow-build-pool6-arm64-2024083011-af5aa803-grp",
        ] -> null
      - name                        = "pool6-arm64-20240830110251604600000001" -> null
      - name_prefix                 = "pool6-arm64-" -> null
      - node_count                  = 1 -> null
      - node_locations              = [
          - "us-central1-a",
          - "us-central1-b",
        ] -> null
      - project                     = "k8s-infra-prow-build" -> null
      - version                     = "1.32.3-gke.1927009" -> null

      - autoscaling {
          - location_policy      = "BALANCED" -> null
          - max_node_count       = 10 -> null
          - min_node_count       = 1 -> null
          - total_max_node_count = 0 -> null
          - total_min_node_count = 0 -> null
        }

      - management {
          - auto_repair  = true -> null
          - auto_upgrade = true -> null
        }

      - node_config {
          - disk_size_gb                = 500 -> null
          - disk_type                   = "pd-ssd" -> null
          - effective_taints            = [
              - {
                  - effect = "NO_SCHEDULE"
                  - key    = "kubernetes.io/arch"
                  - value  = "arm64"
                },
            ] -> null
          - enable_confidential_storage = false -> null
          - image_type                  = "UBUNTU_CONTAINERD" -> null
          - labels                      = {} -> null
          - local_ssd_count             = 0 -> null
          - logging_variant             = "DEFAULT" -> null
          - machine_type                = "t2a-standard-8" -> null
          - metadata                    = {
              - "disable-legacy-endpoints" = "true"
            } -> null
          - oauth_scopes                = [
              - "https://www.googleapis.com/auth/cloud-platform",
            ] -> null
          - preemptible                 = false -> null
          - resource_labels             = {} -> null
          - resource_manager_tags       = {} -> null
          - service_account             = "gke-nodes-prow-build@k8s-infra-prow-build.iam.gserviceaccount.com" -> null
          - spot                        = false -> null
          - storage_pools               = [] -> null
          - tags                        = [] -> null
            # (5 unchanged attributes hidden)

          - shielded_instance_config {
              - enable_integrity_monitoring = true -> null
              - enable_secure_boot          = false -> null
            }

          - taint {
              - effect = "NO_SCHEDULE" -> null
              - key    = "kubernetes.io/arch" -> null
              - value  = "arm64" -> null
            }

          - windows_node_config {
                # (1 unchanged attribute hidden)
            }

          - workload_metadata_config {
              - mode = "GKE_METADATA" -> null
            }
        }

      - upgrade_settings {
          - max_surge       = 1 -> null
          - max_unavailable = 0 -> null
          - strategy        = "SURGE" -> null
        }
    }

Plan: 3 to add, 1 to change, 2 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d infra/gcp/terraform/k8s-infra-prow-build
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.k8s.io/lock?id=kubernetes%252Fk8s.io%252Finfra%252Fgcp%252Fterraform%252Fk8s-infra-prow-build%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d infra/gcp/terraform/k8s-infra-prow-build
  ```
Plan: 3 to add, 1 to change, 2 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```